      ******************************************************************
      * Author: PALMIRA SOLOCHI
      * Date: 27/04/26
      * Purpose: COMO USAR A INSTRUÇÃO CALL DINÁMICA E ESTÁTICA
      * Tectonics: cobc
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROGMODULOS.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.

            STOP RUN.
       END PROGRAM PROGMODULOS.
